import kenall
from .util import *

def test_region_split():
    write_item(
        "\r\n".join(
            [
                '01101,"060  ","0600042","ﾎｯｶｲﾄﾞｳ","ｻｯﾎﾟﾛｼﾁｭｳｵｳｸ","ｵｵﾄﾞｵﾘﾆｼ(1-19ﾁｮｳﾒ)","北海道","札幌市中央区","大通西（１〜１９丁目）",1,0,1,0,0,0,',
                '13307,"19002","1900211","ﾄｳｷｮｳﾄ","ﾆｼﾀﾏｸﾞﾝﾋﾉﾊﾗﾑﾗ","ﾐﾂｺﾞ","東京都","西多摩郡檜原村","三都郷",0,0,0,0,0,0,',
                '13308,"19801","1980213","ﾄｳｷｮｳﾄ","ﾆｼﾀﾏｸﾞﾝｵｸﾀﾏﾏﾁ","ｳﾅｻﾞﾜ","東京都","西多摩郡奥多摩町","海沢",0,0,0,0,0,0,',
                '34101,"730  ","7300851","ﾋﾛｼﾏｹﾝ","ﾋﾛｼﾏｼﾅｶｸ","ｴﾉﾏﾁ","広島県","広島市中区","榎町",0,0,0,0,0,0,',
                '40101,"80001","8000101","ﾌｸｵｶｹﾝ","ｷﾀｷｭｳｼｭｳｼﾓｼﾞｸ","ｲｶﾜ","福岡県","北九州市門司区","伊川",0,0,0,0,0,0,',
                '10344,"37035","3703503","ｸﾞﾝﾏｹﾝ","ｷﾀｸﾞﾝﾏｸﾞﾝｼﾝﾄｳﾑﾗ","ｱﾗｲ","群馬県","北群馬郡榛東村","新井",0,0,0,0,0,0,',
                '13204,"181  ","1810011","ﾄｳｷｮｳﾄ","ﾐﾀｶｼ","ｲｸﾞﾁ","東京都","三鷹市","井口",0,0,1,0,0,0,',
                '13113,"150  ","1506001","ﾄｳｷｮｳﾄ","ｼﾌﾞﾔｸ","ｴﾋﾞｽ","東京都","渋谷区","恵比寿",0,0,0,0,0,0,',
                '13361,"10001","1000102","ﾄｳｷｮｳﾄ","ｵｵｼﾏﾏﾁ","ｵｶﾀ","東京都","大島町","岡田",0,0,0,0,0,0,',
                '13363,"10005","1000511","ﾄｳｷｮｳﾄ","ﾆｲｼﾞﾏﾑﾗ","ｼｷﾈｼﾞﾏ","東京都","新島村","式根島",0,0,0,0,0,0,',
                '13381,"10012","1001212","ﾄｳｷｮｳﾄ","ﾐﾔｹｼﾞﾏﾐﾔｹﾑﾗ","ｱｺ","東京都","三宅島三宅村","阿古",0,0,0,0,0,0,',
                '13421,"10021","1002101","ﾄｳｷｮｳﾄ","ｵｶﾞｻﾜﾗﾑﾗ","ﾁﾁｼﾞﾏ","東京都","小笠原村","父島",0,0,0,0,0,0,',
            ]
        )
    )
    ans = [
        ['北海道','ホッカイドウ','札幌市中央区','サッポロシチュウオウク','','','札幌市','サッポロシ','中央区','チュウオウク','大通西','オオドオリニシ'],
        ['東京都','トウキョウト','西多摩郡檜原村','ニシタマグンヒノハラムラ','西多摩郡','ニシタマグン','檜原村','ヒノハラムラ','','','三都郷','ミツゴ'],
        ['東京都','トウキョウト','西多摩郡奥多摩町','ニシタマグンオクタママチ','西多摩郡','ニシタマグン','奥多摩町','オクタママチ','','','海沢','ウナザワ'],
        ['広島県','ヒロシマケン','広島市中区','ヒロシマシナカク','','','広島市','ヒロシマシ','中区','ナカク','榎町','エノマチ'],
        ['福岡県','フクオカケン','北九州市門司区','キタキュウシュウシモジク','','','北九州市','キタキュウシュウシ','門司区','モジク','伊川','イカワ'],
        ['群馬県','グンマケン','北群馬郡榛東村','キタグンマグンシントウムラ','北群馬郡','キタグンマグン','榛東村','シントウムラ','','','新井','アライ'],
        ['東京都','トウキョウト','三鷹市','ミタカシ','','','三鷹市','ミタカシ','','','井口','イグチ'],
        ['東京都','トウキョウト','渋谷区','シブヤク','','','','','渋谷区','シブヤク','恵比寿','エビス'],
        ['東京都','トウキョウト','大島町','オオシママチ','','','大島町','オオシママチ','','','岡田','オカタ'],
        ['東京都','トウキョウト','新島村','ニイジマムラ','','','新島村','ニイジマムラ','','','式根島','シキネジマ'],
        ['東京都','トウキョウト','三宅島三宅村','ミヤケジマミヤケムラ','','','三宅島三宅村','ミヤケジマミヤケムラ','','','阿古','アコ'],
        ['東京都','トウキョウト','小笠原村','オガサワラムラ','','','小笠原村','オガサワラムラ','','','父島','チチジマ'],
    ]
    postal = kenall.Parser({
        'path': get_csv_path(),
        'encoding': 'utf-8',
        'katakana_h2z': True,
    })
    for row in ans:
        item = next(postal)
        assert row[0] == item.pref
        assert row[1] == item.pref_kana
        assert row[2] == item.region
        assert row[3] == item.region_kana
        assert row[4] == item.district
        assert row[5] == item.district_kana
        assert row[6] == item.city
        assert row[7] == item.city_kana
        assert row[8] == item.ward
        assert row[9] == item.ward_kana
        assert row[10] == item.town
        assert row[11] == item.town_kana

        assert row[0] == item.dict['pref']
        assert row[1] == item.dict['pref_kana']
        assert row[2] == item.dict['region']
        assert row[3] == item.dict['region_kana']
        assert row[4] == item.dict['district']
        assert row[5] == item.dict['district_kana']
        assert row[6] == item.dict['city']
        assert row[7] == item.dict['city_kana']
        assert row[8] == item.dict['ward']
        assert row[9] == item.dict['ward_kana']
        assert row[10] == item.dict['town']
        assert row[11] == item.dict['town_kana']