from .util import *

def test_other():
    write_item('\r\n'.join([
        '26104,"604  ","6040983","ｷｮｳﾄﾌ","ｷｮｳﾄｼﾅｶｷﾞｮｳｸ","ｻｻﾔﾁｮｳ","京都府","京都市中京区","笹屋町（麩屋町通竹屋町下る、麩屋町通夷川上る、竹屋町通麩屋町西入>、竹屋",0,0,0,0,0,0',
        '26104,"604  ","6040983","ｷｮｳﾄﾌ","ｷｮｳﾄｼﾅｶｷﾞｮｳｸ","ｻｻﾔﾁｮｳ","京都府","京都市中京区","笹屋町（だみー、竹屋",0,0,0,0,0,0',
        '26104,"604  ","6040983","ｷｮｳﾄﾌ","ｷｮｳﾄｼﾅｶｷﾞｮｳｸ","ｻｻﾔﾁｮｳ","京都府","京都市中京区","町通麩屋町東入、竹屋町通御幸町西入、夷川通麩屋町西入、夷川通麩屋>町東入）",0,0,0,0,0,0'
    ]))
    postal = generate_parser()
    item = next(postal)
    assert item.town == '笹屋町'
    assert item.town_kana == 'ササヤチョウ'
    assert len(item.subtown) > 0
    assert len(item.subtown_kana) == 0
